app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---

<% @post.comments.each do |c| %>