app/controllers/pages_controller.rb

  def home
    @logged_in_user = User.find_by :id => session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]