app/controllers/posts_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def create
    # render plain: params[:post].inspect

    @post = Post.new(post_params)
    @post.user = User.first