app/controllers/posts_controller.rb

    def create

        post_params = params.require(:post).permit(:name, :city, :objective)
        # render plain: params[:post].inspect
        @post = Post.new(post_params)
        # @post.user_id = current_user.id

        if @post.save
---
INSERT INTO "posts" ("name", "city", "objective", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Post1"], ["city", "Sydney"], ["objective", "Yes"], ["created_at", "2019-10-31 08:45:17.739490"], ["updated_at", "2019-10-31 08:45:17.739490"]]

    def update

        post_params = params.require(:post).permit(:name, :city, :objective)

        @post = Post.find(params[:id])

        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "hello1"], ["updated_at", "2020-05-21 15:50:39.143083"], ["id", 2]]