app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "shklsh@hotmail.com"], ["LIMIT", 1]]
---
  def create
  # This is the action to which the login form post request is posted. It will add the
  #user's id to the session hash, which will be used for authentication and
  #authorization throughout the session.
    user = User.find_by :email => params[:email]