app/controllers/users_controller.rb

    def create

        form_params = params.require(:user)
        .permit(:name, :age, :email, :password, :password_confirmation)

        @user = User.new(form_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "brian"], ["password_digest", "$2a$12$E.u/oRaBV0KGPaN2xVB0VuVMsNZVxspI8NCd1.FlysTssR9YTUBEO"], ["created_at", "2019-10-31 09:12:41.265942"], ["updated_at", "2019-10-31 09:12:41.265942"]]